УНФ_ТЕСТ/src/Enums/ОснованиеПечатиСпособНачальногоЗаполнение/ОснованиеПечатиСпособНачальногоЗаполнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОснованиеПечатиСпособНачальногоЗаполнение</name>
  <enumValues>
    <name>ТекущийДокумент</name>
  </enumValues>
  <enumValues>
    <name>ДоговорКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ОставлятьПустым</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <predefined>
    <items>
      <name>ОсновнаяОрганизация</name>
      <description>Наша фирма</description>
    </items>
  </predefined>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбменаСКонтролирующимиОрганами</name>
    <type>
      <types>EnumRef.УдалитьВидыОбменаСКонтролирующимиОрганами</types>
      <types>EnumRef.ВидыОбменаСКонтролирующимиОрганами</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаСтраховыхВзносов</name>
    <type>
      <types>EnumRef.ВидыУчетаСтраховыхВзносов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИностраннаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИПИспользуетТрудНаемныхРаботников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяОтчетность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаПоУмолчанию</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОрганаПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаФСГС</name>
    <comment>Код территориального органа государственной статистики </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрупнейшийНалогоплательщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПлательщикаПриПеречисленииНалогов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТерриториальногоОрганаФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДСВключатьВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПФР_ИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтавкаНДСПоУмолчанию</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифНаТравматизм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьGCP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьGLN</name>
    <type>
      <types>DefinedType.GLN</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОбмена</name>
    <type>
      <types>CatalogRef.УдалитьУчетныеЗаписиДокументооборота</types>
      <types>CatalogRef.УчетныеЗаписиДокументооборота</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЛоготип</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлФаксимильнаяПечать</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДСПоУмолчанию</name>
    <type>
      <types>EnumRef.ВидыСтавокНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПострадавшаяИзРеестраМСП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоддержкаИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/CommonModules/ПечатьДокументовУНФКлиент/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьЗначенияРеквизитовПечати(ТекущийОбъект, ИзмененныеРеквизиты) Экспорт
	
	Если ТекущийОбъект.ТолькоПросмотр Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого ЭлементСтруктуры Из ИзмененныеРеквизиты Цикл
		
		ТекущийОбъект.Объект[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
		
		Если НЕ ТекущийОбъект.Модифицированность Тогда
			
			ТекущийОбъект.Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПредложитьЗаполнитьРеквизитыОрганизации(ПараметрыПечати) Экспорт
	
	ОткрытьФормуЗаполненияРеквизитовДляПечати(ПараметрыПечати, "ПодписьРуководителя,ПодписьГлавногоБухгалтера,ИНН,КПП,БанковскийСчетПоУмолчанию,ФайлЛоготип,ЮрАдрес");
	
КонецФункции

Функция ПредложитьЗаполнитьРеквизитыОрганизацииСФаксимильнойПодписью(ПараметрыПечати) Экспорт
	
	ОткрытьФормуЗаполненияРеквизитовДляПечати(ПараметрыПечати, "ПодписьРуководителя,ПодписьГлавногоБухгалтера,ИНН,КПП,БанковскийСчетПоУмолчанию,ФайлЛоготип,ЮрАдрес,ФайлФаксимильнаяПечать");
	
КонецФункции

Процедура ОткрытьФормуЗаполненияРеквизитовДляПечати(ПараметрыПечати, ИменаРеквизитовДляЗаполнения)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяМенеджераПечати", ПараметрыПечати.МенеджерПечати);
	ПараметрыФормы.Вставить("ИменаМакетов", ПараметрыПечати.Идентификатор);
	ПараметрыФормы.Вставить("ПараметрКоманды", ПараметрыПечати.ОбъектыПечати);
	ПараметрыФормы.Вставить("ИменаРеквизитовДляЗаполнения", ИменаРеквизитовДляЗаполнения);
	ПараметрыФормы.Вставить("ПараметрыПечати", Новый Структура);
	Для Каждого КлючИЗначение Из ПараметрыПечати Цикл
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("ФормаКлиентскогоПриложения") Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыФормы.ПараметрыПечати.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	ПараметрыФормы.Вставить(
	"Ключ",
	УправлениеНебольшойФирмойСервер.ОрганизацияИзПараметраКоманды(ПараметрыФормы.ПараметрКоманды));
	
	Если ЗначениеЗаполнено(ПараметрыФормы.Ключ) Тогда
		
		ФормаЗаполненияРеквизитовДляПечати = ОткрытьФорму(
		"Справочник.Организации.Форма.ФормаЗаполненияРеквизитовДляПечати",
		ПараметрыФормы,
		Строка(Новый УникальныйИдентификатор));
		
		Если ФормаЗаполненияРеквизитовДляПечати <> Неопределено Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
	ПараметрыФормы.ИмяМенеджераПечати,
	ПараметрыФормы.ИменаМакетов,
	ПараметрыФормы.ПараметрКоманды,
	ПараметрыПечати.Форма,
	ПараметрыФормы);
	
КонецПроцедуры

Процедура ОбработкаКомандыПечатиЦенниковИЭтикетокНаПринтереЭтикеток(ПараметрыПечати) Экспорт
	
	Обработка = ПараметрыПечати.ОбъектыПечати[0];
	
	Если Обработка.Товары.НайтиСтроки(Новый Структура("Выбран", Истина)).Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбрано ни одного товара'"));
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПечати.Свойство("ИдентификаторФормы") Тогда
		ИдентификаторФормы = ПараметрыПечати.ИдентификаторФормы;
	Иначе
		ИдентификаторФормы = ПараметрыПечати.Форма.УникальныйИдентификатор;
	КонецЕсли;
	
	ДанныеДляПринтераЭтикеток = УправлениеНебольшойФирмойВызовСервера.ПодготовитьСтруктуруДанныхЦенниковИЭтикетокДляПринтераЭтикеток(Обработка, ПараметрыПечати.МенеджерПечати, ПараметрыПечати.ТекущийРазмер);
	
	Если ДанныеДляПринтераЭтикеток.Количество() > 0 Тогда
		
		Для Каждого ТекМакет Из ДанныеДляПринтераЭтикеток Цикл
			
			ЗавершениеПечати = Новый ОписаниеОповещения("ОбработкаКомандыПечатиЦенниковИЭтикетокНаПринтереЭтикетокЗавершение", ПечатьДокументовУНФКлиент, ТекМакет);
			
			МенеджерОборудованияКлиент.НачатьПечатьЭтикеток(ЗавершениеПечати, ИдентификаторФормы, ТекМакет.XML, ТекМакет.Этикетки);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаКомандыПечатиЦенниковИЭтикетокНаПринтереЭтикетокЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		Возврат;
		
	Иначе
		
		ТекстСообщения = НСтр(
			"ru = 'При печати произошла ошибка.
			|Дополнительное описание:
			|%ДополнительноеОписание%'"
		);
		ТекстСообщения = СтрЗаменить(
			ТекстСообщения,
			"%ДополнительноеОписание%",
			РезультатВыполнения.ОписаниеОшибки
		);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

#Область КлиентскиеМетодыПечати

Функция ПечатьКонтактнойИнформации(ПараметрыПечати) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтрагентыНачальноеЗначение", ПараметрыПечати.ОбъектыПечати);
	
	Если ПараметрыПечати.ОбъектыПечати.Количество() > 0 Тогда
		КлючУникальности = ПараметрыПечати.ОбъектыПечати[0];
	Иначе
		КлючУникальности = Ложь;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаКонтактнойИнформации", ПараметрыФормы, , КлючУникальности);
	
КонецФункции

Функция ПечатьКонверта(ОписаниеКоманды) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектыПечати", ОписаниеКоманды.ОбъектыПечати);
	
	ОткрытьФорму("Обработка.ПечатьКонвертов.Форма", ПараметрыФормы);
	
КонецФункции

#КонецОбласти

#Область ПриИзмененииРеквизитовФорм

Процедура ПриИзмененииДоговораКонтрагента(ДоговорПослеИзменения, ОснованиеПечатиСсылка, ОснованиеПечати, ДополнительныеПараметры = Неопределено) Экспорт
	
	ЗаполнитьОснованиеПечатиДоговором = Истина;
	ДобавитьСловоДоговорВПредставлениеДоговораОснованияПечати = Истина;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		
		ЗначениеКонстанты = Неопределено;
		Если ДополнительныеПараметры.Свойство("ОснованиеПечатиСчетНаОплату", ЗначениеКонстанты) Тогда
			
			ЗаполнитьОснованиеПечатиДоговором = (ЗначениеКонстанты = ПредопределенноеЗначение("Перечисление.ОснованиеПечатиСпособНачальногоЗаполнение.ДоговорКонтрагента"));
			
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ОснованиеПечатиЗаказПокупателя", ЗначениеКонстанты) Тогда
			
			ЗаполнитьОснованиеПечатиДоговором = (ЗначениеКонстанты = ПредопределенноеЗначение("Перечисление.ОснованиеПечатиСпособНачальногоЗаполнение.ДоговорКонтрагента"));
			
		КонецЕсли;
		
		ДополнительныеПараметры.Свойство("ДобавитьСловоДоговорВПредставлениеДоговораОснованияПечати", ДобавитьСловоДоговорВПредставлениеДоговораОснованияПечати);
		ДобавитьСловоДоговорВПредставлениеДоговораОснованияПечати = (ДобавитьСловоДоговорВПредставлениеДоговораОснованияПечати = Неопределено ИЛИ ДобавитьСловоДоговорВПредставлениеДоговораОснованияПечати = Истина);
		
	КонецЕсли;
	
	Если ЗаполнитьОснованиеПечатиДоговором Тогда
		
		Если НЕ ЗначениеЗаполнено(ДоговорПослеИзменения) Тогда
			
			Если НЕ ЗначениеЗаполнено(ОснованиеПечатиСсылка)
				ИЛИ ТипЗнч(ОснованиеПечатиСсылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				
				ОснованиеПечатиСсылка = Неопределено;
				ОснованиеПечати = "";
				
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ДоговорПослеИзменения) Тогда
			
			Если НЕ ЗначениеЗаполнено(ОснованиеПечатиСсылка)
				ИЛИ ТипЗнч(ОснованиеПечатиСсылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
				ОснованиеПечатиСсылка = ДоговорПослеИзменения;
				
				ЗаголовокПредставления = "";
				Если ДобавитьСловоДоговорВПредставлениеДоговораОснованияПечати Тогда
					
					ЗаголовокПредставления = Нстр("ru = 'Договор: '");
					
				КонецЕсли;
				
				ОснованиеПечати = ЗаголовокПредставления + Строка(ДоговорПослеИзменения);
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
